Revit 2015 API
ValueParsingOptions Properties
The ValueParsingOptions type exposes the following members.
Properties
Name | Description
AllowedValues
 The allowable range of values to be parsed.
FormatOptions |  Obsolete.
 The FormatOptions to optionally override the default settings in the Units class.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace